Courses/4420/Lectures/LinuxSetup/BootUp/bootup-labs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lab: OS BootUp in Computer Security</title>
<!-- 2017-09-21 Thu 20:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: OS BootUp in Computer Security</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Background</a></li>
<li><a href="#sec-2">2. Abstract</a></li>
<li><a href="#sec-3">3. Educational Objectives</a></li>
<li><a href="#sec-4">4. Lab for 2017 Fall CEG 4420/6420</a></li>
<li><a href="#sec-5">5. Lab: From Legitimate Init to User Login</a></li>
<li><a href="#sec-6">6. Lab:  Knoppix Bootup</a></li>
<li><a href="#sec-7">7. Lab:  Kali Bootup</a></li>
<li><a href="#sec-8">8. Lab: Power On to OS Loader Selection</a></li>
<li><a href="#sec-9">9. Lab: OS Loader to OS Kernel Selection</a></li>
<li><a href="#sec-10">10. Lab: OS Kernel to Process init</a></li>
<li><a href="#sec-11">11. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Required Reading: BootUp in Computer Security
</li>
<li>Required Reading and Lab: USBD Multi-Boot Linux
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Abstract</h2>
<div class="outline-text-2" id="text-2">
<p>
Abstract: We discuss how a computer system boots from powering up to
user login prompt.  This article is a description of how a Linux PC
boots starting from power-on to user login.  Our focus is on what +
how things can "go wrong" from a security point of view.  This
discussion is specific to Linux and Intel x86.  But similar steps are
valid for other computer systems.  So that a technique is understood,
we often gloss over the details, even if it is at the risk of
precision, but not at the level of "whole truth".
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Educational Objectives</h2>
<div class="outline-text-2" id="text-3">
<p>
Student should be able
</p>

<ol class="org-ol">
<li>Describe how a computer system boots from power-on.
</li>
<li>Recognize the possibilities for Trojans.
</li>
<li>Recognize unneeded daemons.
</li>
<li>Develop a proper secure boot configuration
</li>
</ol>


<p>
[This page collects several possible labs.  Each semester, we select a
subset.]
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lab for 2017 Fall CEG 4420/6420</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Lab: From Legitimate Init to User Login
</li>
<li>Lab: Power On to OS Loader Selection
</li>

<li>Lab: OS Loader to OS Kernel Selection
</li>

<li>Lab: OS Kernel Initialization to the First Process init
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Lab: From Legitimate Init to User Login</h2>
<div class="outline-text-2" id="text-5">
<p>
Objective: <i>Study</i> the booting sequence ending at login prompt.
</p>

<ol class="org-ol">
<li>Freshly reboot into your choice of (HDD installed) Linux.  Wait
for the GUI to show.
</li>
<li>Save the output of <code>ps</code> with flags that show all processes with
the greatest amount of detail.  You will notice several gaps in
the process id numbers.
</li>
<li>Consider process ids in the ranges of 1 to 100, and 900 to 1000.
Note the missing pids.  Among the missing ids, explain the
details of &lt;i&gt;at least five&lt;/i&gt; processes from the range 1 to 100
and another five from 900 to 1000 that must have come to life,
performed their duties, and terminated.
</li>
<li>Be aware that the bash shell has many built in commands such as
<code>echo</code>  that do not cause process creation.
</li>
<li>Among the currently running processes, identify &lt;i&gt;all&lt;/i&gt; the
daemon processes, and how and where from they were invoked.
</li>
<li>The specific names of script files in the current installation of Linux 
are not necessarily rc.multiuser etc as indicated in the sections above.  
Find and correct all such names.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Lab:  Knoppix Bootup</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Describe the bootup details of Knoppix.  Focus on how it detects
the hardware you have (almost always) correctly.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Lab:  Kali Bootup</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Describe the bootup details of Kali Linux.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Lab: Power On to OS Loader Selection</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>[Devious.]  Suggest how an Alternate OS Loader can be installed and
made effective.  That is, instead of invoking the OS Boot Loader
you thought you installed, another one has taken over.
</li>

<li>This should not be easy to detect.
</li>

<li>Outline how this can be detected.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Lab: OS Loader to OS Kernel Selection</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>Use your MultiBoot Linux USBD.
</li>
<li>Install at least two different kernels.  Need not be rogue kernels.
Make them selectable via the (legitimate) OS Boot Loader (e.g.,
Grub).
</li>
<li>On a HDD installed Linux, this happens all the time.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Lab: OS Kernel to Process init</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>Describe how the kernel selects  the init program.  Doe the kernel
log this info somewhere?
</li>

<li>[Devious.] Plant an alternate, fully functional but rogue,
<code>init</code>.
</li>

<li>Did the kernel know it is invoking an alternate init, possibly a
rogue init?  How can you discover the rogue init?
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> End</h2>
<div class="outline-text-2" id="text-11">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-09-20
</div>
</body>
</html>
